# print문과 format함수
a = '사과'
b = '배'
c = '옥수수'

print("선생님은 잘생기셨다.")
print(a) # 사과
print(a,b) # 사과배 # 사과 배
print(a,b,c) # 사과배옥수수 # 사과 배 옥수수

print("나는 {0}를 먹었다.".format(a)) # 나는 사과를 먹었다.
print("나는 {0}와 {1}를 먹었다.".format(a,b)) # 나는 사과와 배를 먹었다.
print("나는 {0}와 {1}와 {2}를 먹었다.".format(a,b,c)) # 나는 사과와 배와 옥수수를 먹었다.

print('나는',a+'를 먹었다.') # 나는 사과를 먹었다.
print('나는',a,'를 먹었다.') # 나는 사과 를 먹었다.
print('나는',a,'와',b,'를','먹었다.',sep='?') # 나는?사과?와?배?를?먹었다.
print('나는',a,'와',b,'와',c,'를','먹었다.',sep='') # 나는사과와배와옥수수를먹었다.
print('나는 ',a,'와 ',b,'와 ',c,'를 ','먹었다.',sep='') # 나는 사과와 배와 옥수수를 먹었다.
